set_property -dict {PACKAGE_PIN R4 IOSTANDARD LVCMOS33} [get_ports fpga_clk]
create_clock -period 10.000 -name fpga_clk -waveform {0.000 5.000} [get_ports fpga_clk]
create_clock -period 1000.000 -name jtag_tck -waveform {0.000 500.000} [get_ports jtag_tck]
set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets jtag_tck_IBUF]
create_generated_clock -name sys_clk -source [get_pins u_pll/inst/mmcm_adv_inst/CLKIN1] -master_clock [get_clocks fpga_clk] [get_pins u_pll/inst/mmcm_adv_inst/CLKOUT0]
create_generated_clock -name lfclk -source [get_pins u_pll/inst/mmcm_adv_inst/CLKIN1] -master_clock [get_clocks fpga_clk] [get_pins u_pll/inst/mmcm_adv_inst/CLKOUT1]
set_false_path -from fpga_rst_n
set_false_path -from [get_clocks sys_clk] -to [get_clocks jtag_tck]
set_false_path -from [get_clocks jtag_tck] -to [get_clocks sys_clk]
set_false_path -from [get_clocks sys_clk] -to [get_clocks lfclk]
set_false_path -from [get_clocks lfclk] -to [get_clocks sys_clk]
#####            rst define           #####
set_property IOSTANDARD LVCMOS15 [get_ports fpga_rst_n]
set_property PACKAGE_PIN G4 [get_ports fpga_rst_n]

#####               MCU JTAG define           #####
set_property IOSTANDARD LVCMOS33 [get_ports jtag_tdo]
set_property IOSTANDARD LVCMOS33 [get_ports jtag_tck]
set_property IOSTANDARD LVCMOS33 [get_ports jtag_tdi]
set_property IOSTANDARD LVCMOS33 [get_ports jtag_tms]
set_property PACKAGE_PIN AB22 [get_ports jtag_tdo]
set_property PACKAGE_PIN AB21 [get_ports jtag_tck]
set_property PACKAGE_PIN Y21 [get_ports jtag_tdi]
set_property PACKAGE_PIN AA21 [get_ports jtag_tms]

set_property IOSTANDARD LVCMOS33 [get_ports uart_txd]
set_property IOSTANDARD LVCMOS33 [get_ports uart_rxd]
set_property PACKAGE_PIN AA19 [get_ports uart_txd]
set_property PACKAGE_PIN V18 [get_ports uart_rxd]

set_property IOSTANDARD LVCMOS33 [get_ports {gpio[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio[3]}]
set_property PACKAGE_PIN T14 [get_ports {gpio[0]}]
set_property PACKAGE_PIN T15 [get_ports {gpio[1]}]
set_property PACKAGE_PIN T16 [get_ports {gpio[2]}]
set_property PACKAGE_PIN U16 [get_ports {gpio[3]}]

#set_property IOSTANDARD LVCMOS33 [get_ports debug]
#set_property PACKAGE_PIN AB18 [get_ports debug]
#####         SPI Configurate Setting        #######
set_property BITSTREAM.CONFIG.SPI_BUSWIDTH 4 [current_design]
set_property CONFIG_MODE SPIx4 [current_design]
set_property BITSTREAM.CONFIG.CONFIGRATE 50 [current_design]

set_output_delay 1.000 [get_ports {{gpio[0]} {gpio[1]} {gpio[2]} {gpio[3]}}]
set_output_delay 5.000 -clock jtag_tck [get_ports {jtag_tdo}]
set_input_delay 5.000 -clock jtag_tck [get_ports {jtag_tdi}]
set_input_delay 5.000 -clock jtag_tck [get_ports {jtag_tms}]
set_output_delay 5.000 [get_ports {uart_txd}]
set_input_delay 1.000 [get_ports {{gpio[0]} {gpio[1]} {gpio[2]} {gpio[3]}}]
set_input_delay 5.000 [get_ports {fpga_rst_n}]
set_input_delay 5.000 [get_ports {uart_rxd}]
